{"class_name": "Model", "keras_version": "2.0.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 6400], "name": "input_7", "sparse": false}, "inbound_nodes": [], "name": "input_7"}, {"class_name": "Reshape", "config": {"target_shape": [80, 80, 1], "trainable": true, "name": "reshape_11"}, "inbound_nodes": [[["input_7", 0, 0, {}]]], "name": "reshape_11"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_11", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 5, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [4, 4]}, "inbound_nodes": [[["reshape_11", 0, 0, {}]]], "name": "conv2d_11"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_28", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 25, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "name": "dense_28"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_11"}, "inbound_nodes": [[["dense_28", 0, 0, {}]]], "name": "flatten_11"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1], "name": "input_8", "sparse": false}, "inbound_nodes": [], "name": "input_8"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_4", "axis": -1}, "inbound_nodes": [[["flatten_11", 0, 0, {}], ["input_8", 0, 0, {}]]], "name": "concatenate_4"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_29", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_4", 0, 0, {}]]], "name": "dense_29"}], "input_layers": [["input_7", 0, 0], ["input_8", 0, 0]], "output_layers": [["dense_29", 0, 0]], "name": "model_4"}, "backend": "tensorflow"}