{"class_name": "Model", "keras_version": "2.0.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 80, 80, 1], "name": "input_47", "sparse": false}, "inbound_nodes": [], "name": "input_47"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_23", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 5, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [4, 4]}, "inbound_nodes": [[["input_47", 0, 0, {}]]], "name": "conv2d_23"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_35", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 25, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "name": "dense_35"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_18"}, "inbound_nodes": [[["dense_35", 0, 0, {}]]], "name": "flatten_18"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1], "name": "input_48", "sparse": false}, "inbound_nodes": [], "name": "input_48"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_18", "axis": -1}, "inbound_nodes": [[["flatten_18", 0, 0, {}], ["input_48", 0, 0, {}]]], "name": "concatenate_18"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_36", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_18", 0, 0, {}]]], "name": "dense_36"}], "input_layers": [["input_47", 0, 0], ["input_48", 0, 0]], "output_layers": [["dense_36", 0, 0]], "name": "model_18"}, "backend": "tensorflow"}