{"class_name": "Model", "keras_version": "2.0.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 6400], "name": "input_9", "sparse": false}, "inbound_nodes": [], "name": "input_9"}, {"class_name": "Reshape", "config": {"target_shape": [80, 80, 1], "trainable": true, "name": "reshape_16"}, "inbound_nodes": [[["input_9", 0, 0, {}]]], "name": "reshape_16"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_16", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 5, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [4, 4]}, "inbound_nodes": [[["reshape_16", 0, 0, {}]]], "name": "conv2d_16"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_42", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 25, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "name": "dense_42"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_16"}, "inbound_nodes": [[["dense_42", 0, 0, {}]]], "name": "flatten_16"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1], "name": "input_10", "sparse": false}, "inbound_nodes": [], "name": "input_10"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_5", "axis": -1}, "inbound_nodes": [[["flatten_16", 0, 0, {}], ["input_10", 0, 0, {}]]], "name": "concatenate_5"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_43", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_5", 0, 0, {}]]], "name": "dense_43"}], "input_layers": [["input_9", 0, 0], ["input_10", 0, 0]], "output_layers": [["dense_43", 0, 0]], "name": "model_5"}, "backend": "tensorflow"}